In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('unis-tech-raw.csv', index_col=0)
df.head(3)

,Location,School,Course,Degree_type,Pace,Duration,Language,Mode,Start_date,Description,Link
0,"Barcelona, Spain +1 More",Harbour.Space University,Bachelor of Computer Science,Bachelor,Full-time,3 years,English,Campus,Unknown,Harbour.Space Computer Science Bachelor progra...,https://www.bachelorstudies.com/Bachelor-of-Co...
1,"Marbella, Spain",Schellhammer Business School,Bachelor in IT and Computing (Online),Bachelor's,Full-time,3 years,English,Online,Unknown,This IT and Computing Undergraduate degree off...,https://www.onlinestudies.com/Bachelor-in-IT-a...
2,"Berlin, Germany",IU International University of Applied Science...,B.Sc. Software Development,BSc,Full-time,36 months,English,Online,Unknown,Learn the skills needed to be a successful sof...,https://www.onlinestudies.com/B.Sc.-Software-D...

In [3]:
df.replace("Unknown", np.nan, inplace = True)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1662 entries, 0 to 1661
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Location     1647 non-null   object
 1   School       1662 non-null   object
 2   Course       1662 non-null   object
 3   Degree_type  1662 non-null   object
 4   Pace         1148 non-null   object
 5   Duration     997 non-null    object
 6   Language     1582 non-null   object
 7   Mode         1552 non-null   object
 8   Start_date   398 non-null    object
 9   Description  1662 non-null   object
 10  Link         1650 non-null   object
dtypes: object(11)
memory usage: 155.8+ KB

In [5]:
df.isna().sum()/len(df)

Location       0.009025
School         0.000000
Course         0.000000
Degree_type    0.000000
Pace           0.309266
Duration       0.400120
Language       0.048135
Mode           0.066185
Start_date     0.760529
Description    0.000000
Link           0.007220
dtype: float64

In [6]:
df.drop('Start_date', axis = 1, inplace = True)

In [7]:
df['Location'].value_counts()

Dubai, United Arab Emirates    27
Kuala Lumpur, Malaysia         27
Istanbul, Turkey               15
Berlin, Germany                15
Moscow, Russia                 14
                               ..
Shizuoka, Japan                 1
Cartagena, Colombia             1
Birmingham, United Kingdom      1
Altoona, USA                    1
Varna, Bulgaria                 1
Name: Location, Length: 846, dtype: int64

In [9]:
df['Location'].str.split(',', expand=True)

               0                         1     2
0      Barcelona             Spain +1 More  None
1       Marbella                     Spain  None
2         Berlin                   Germany  None
3     Bad Honnef           Germany +1 More  None
4          Emmen               Netherlands  None
...          ...                       ...   ...
1657  Manchester               USA +1 More  None
1658       Viseu                  Portugal  None
1659      Hebron   Palestinian Territories  None
1660      Hebron   Palestinian Territories  None
1661      Trento                     Italy  None

[1662 rows x 3 columns]

In [10]:
df['Location'].str.split(',', expand=True).isna().sum()

0      15
1      26
2    1660
dtype: int64

In [11]:
location = df['Location'].str.split(',', expand=True)
location.head()

            0                 1     2
0   Barcelona     Spain +1 More  None
1    Marbella             Spain  None
2      Berlin           Germany  None
3  Bad Honnef   Germany +1 More  None
4       Emmen       Netherlands  None

In [12]:
location[1].str.split('+', expand = True)[0]

0                         Spain
1                          Spain
2                        Germany
3                       Germany
4                    Netherlands
                  ...
1657                        USA
1658                    Portugal
1659     Palestinian Territories
1660     Palestinian Territories
1661                       Italy
Name: 0, Length: 1662, dtype: object

In [13]:
countries = []
for c in location[1].str.split('+', expand = True)[0]:
    try:
        countries.append(c.strip())
    except:
        countries.append(c)

In [14]:
len(countries)

1662

In [15]:
df['Country'] = countries
df['City'] = location[0]

In [16]:
df['Country'].value_counts()

USA               476
United Kingdom    124
Russia             66
China              66
Germany            62
                 ...
Kenya               1
Zimbabwe            1
Afghanistan         1
Ghana               1
Lesotho             1
Name: Country, Length: 92, dtype: int64

In [17]:
from pycountry_convert import country_alpha2_to_continent_code, country_name_to_country_alpha2

continents = []
for c in df['Country']:
    try: 
        con = country_alpha2_to_continent_code(country_name_to_country_alpha2(c))
    except:
        con = np.nan
    continents.append(con)
    
df['Continent'] = continents

In [18]:
df['Continent'].value_counts()

EU    582
NA    542
AS    395
OC     50
AF     32
SA     30
Name: Continent, dtype: int64

In [23]:
df['Degree_type'].value_counts()

Bachelor    817
BSc         737
BA           80
BBA          28
Name: Degree_type, dtype: int64

In [20]:
df['Degree_type'] = df['Degree_type'].str.split(expand = True)[0]

In [22]:
df.replace("Bachelor's", 'Bachelor', inplace = True)

In [24]:
df['Pace'].value_counts()

Full-time    1119
Part-time      29
Name: Pace, dtype: int64

In [25]:
df['Duration'].value_counts()

4 years            445
3 years            234
3 - 4 years         42
8 semesters         34
7 semesters         30
3 - 6 years         29
4 - 5 years         26
5 years             17
6 semesters         16
3 - 5 years         15
36 months           13
36 - 72 months      12
2 years             12
48 months            6
6 years              5
42 months            4
2 - 3 years          4
2 - 4 years          4
9 semesters          3
36 - 48 months       3
4 - 6 years          3
20 months            2
8 weeks              2
40 months            2
4 - 7 years          2
20 - 29 months       2
18 months            2
16 - 20 months       2
4 - 8 years          2
28 - 36 months       1
180 hours            1
4 semesters          1
8 years              1
10 semesters         1
136 hours            1
122 hours            1
5 semesters          1
12 months            1
30 - 72 months       1
2 semesters          1
54 months            1
42 - 54 months       1
7 - 9 semesters      1
9 months             1
11 semesters         1
7 months             1
18 - 24 months       1
185 hours            1
3 semesters          1
6 - 16 years         1
5 - 6 years          1
29 months            1
4 - 8 semesters      1
Name: Duration, dtype: int64

In [26]:
length = df['Duration'].str.split(' ', expand=True)
length[:15]

        0          1
0       3      years
1       3      years
2      36     months
3      36     months
4       4      years
5       7  semesters
6      36     months
7       3      years
8       4      years
9       7  semesters
10  3 - 4      years
11      4      years
12      6  semesters
13      3      years
14      3      years

In [27]:
length.isna().sum()/len(df)

0    0.40012
1    0.40012
dtype: float64

In [28]:
for i in range(0,len(length)):
    try:
        if len(str(length[0][i])) > 3:
            if length[0][i].split()[1] == '-':
                length[0][i] = (int(length[0][i].split()[0])+int(length[0][i].split()[2]))/2
    except:
        print(i)

In [29]:
length[:15]

      0          1
0     3      years
1     3      years
2    36     months
3    36     months
4     4      years
5     7  semesters
6    36     months
7     3      years
8     4      years
9     7  semesters
10  3.5      years
11    4      years
12    6  semesters
13    3      years
14    3      years

In [30]:
length[1].value_counts()

years        843
semesters     91
months        57
hours          4
weeks          2
Name: 1, dtype: int64

In [31]:
for i in range(0,len(length)):
    if length[1][i] == 'semesters':
        try:
            length[0][i] = int(length[0][i])/2
            length[1][i] = 'years'
        except:
            print(i)
            print(length[0][i])
    if length[1][i] == 'months':
        try:
            length[0][i] = int(length[0][i])/12
            length[1][i] = 'years'
        except:
            print(i)
            print(length[0][i])
    if length[1][i] == 'hours' or length[1][i] == 'weeks':
        length[1][i] = np.nan
        length[0][i] = np.nan

In [32]:
df['Duration_years'] = length[0]

In [33]:
df['Duration_years'].value_counts()

4                     445
3                     234
3.5                    79
4.5                    71
4.0                    57
3.0                    34
5                      17
2                      12
1.5                     5
6                       5
2.5                     5
5.0                     4
5.5                     4
2.0                     3
1.0                     2
6.0                     2
3.3333333333333335      2
1.6666666666666667      2
8                       1
4.25                    1
0.5833333333333334      1
11.0                    1
1.75                    1
2.6666666666666665      1
2.4166666666666665      1
0.75                    1
Name: Duration_years, dtype: int64

In [34]:
df[['Duration','Duration_years']].head(15)

       Duration Duration_years
0       3 years              3
1       3 years              3
2     36 months              3
3     36 months              3
4       4 years              4
5   7 semesters            3.5
6     36 months              3
7       3 years              3
8       4 years              4
9   7 semesters            3.5
10  3 - 4 years            3.5
11      4 years              4
12  6 semesters              3
13      3 years              3
14      3 years              3

In [35]:
df['Language'].value_counts()

English            1198
Russian              56
Spanish              31
Japanese             30
Chinese              21
                   ...
English, Polish       1
Catalan               1
English, Hebrew       1
Croatian              1
Dutch, English        1
Name: Language, Length: 79, dtype: int64

In [36]:
langs = df['Language'].str.split(expand=True)
langs.isna().sum()

0      80
1    1516
2    1643
3    1658
dtype: int64

In [37]:
InEnglish = []
for i in range(0,len(langs)):
    try:
        if langs[0][i].strip(',') == 'English' or langs[1][i].strip(',') == 'English' or langs[2][i].strip(',') == 'English' or langs[3][i].strip(',') == 'English':
            InEnglish.append(True)
        else:
            InEnglish.append(False)
    except:
            InEnglish.append(False)

In [38]:
df['InEnglish'] = InEnglish

In [39]:
df['InEnglish'].value_counts()

True     1286
False     376
Name: InEnglish, dtype: int64

In [40]:
lang_prim = []
for l in df['Language'].str.split(expand=True)[0]:
    try:
        lang_prim.append(l.strip(','))
    except:
        lang_prim.append(l)
        
len(lang_prim)

1662

In [41]:
df['Lang_primary'] = lang_prim
df['Lang_primary'].value_counts()

English         1266
Spanish           65
Russian           64
Japanese          30
Portuguese        27
Chinese           23
Polish            19
German            13
French            11
Kazakh             8
Bulgarian          6
Turkish            6
Rumenian           6
Czech              4
Greek              3
Dutch              3
Serbian            3
Hebrew             3
Thai               2
Danish             2
Vietnamesian       2
Georgian           2
Catalan            2
Albanian           2
Bosnian            2
Ukrainian          2
Finnish            1
Croatian           1
Korean             1
Estonian           1
Indonesian         1
Italian            1
Name: Lang_primary, dtype: int64

In [42]:
lang_vals = df['Lang_primary'].value_counts()
for i in lang_vals.index:
    if lang_vals[i] < 10:
        df['Lang_primary'].replace(i, 'Other', inplace = True)

In [43]:
df['Lang_primary'].value_counts()

English       1266
Spanish         65
Other           64
Russian         64
Japanese        30
Portuguese      27
Chinese         23
Polish          19
German          13
French          11
Name: Lang_primary, dtype: int64

In [44]:
df['Mode'].value_counts()

Campus                      1396
Online                       106
Online & Campus Combined      50
Name: Mode, dtype: int64

In [45]:
df.head()

,Location,School,Course,Degree_type,Pace,Duration,Language,Mode,Description,Link,Country,City,Continent,Duration_years,InEnglish,Lang_primary
0,"Barcelona, Spain +1 More",Harbour.Space University,Bachelor of Computer Science,Bachelor,Full-time,3 years,English,Campus,Harbour.Space Computer Science Bachelor progra...,https://www.bachelorstudies.com/Bachelor-of-Co...,Spain,Barcelona,EU,3,True,English
1,"Marbella, Spain",Schellhammer Business School,Bachelor in IT and Computing (Online),Bachelor,Full-time,3 years,English,Online,This IT and Computing Undergraduate degree off...,https://www.onlinestudies.com/Bachelor-in-IT-a...,Spain,Marbella,EU,3,True,English
2,"Berlin, Germany",IU International University of Applied Science...,B.Sc. Software Development,BSc,Full-time,36 months,English,Online,Learn the skills needed to be a successful sof...,https://www.onlinestudies.com/B.Sc.-Software-D...,Germany,Berlin,EU,3,True,English
3,"Bad Honnef, Germany +1 More",IU International University of Applied Science...,B.Eng. Industrial Engineering and Management,Bachelor,Full-time,36 months,English,Online & Campus Combined,Looking for a study programme that trains you ...,https://www.bachelorstudies.com//B.Eng.-Indust...,Germany,Bad Honnef,EU,3,True,English
4,"Emmen, Netherlands",NHL Stenden University of Applied Sciences,Bachelor in Information Technology (IT),Bachelor,Full-time,4 years,English,Campus,"Work in a challenging and exciting field, whil...",https://www.bachelorstudies.com/Bachelor-in-In...,Netherlands,Emmen,EU,4,True,English

In [52]:
df.isna().sum()/len(df)

Location          0.009025
School            0.000000
Course            0.000000
Degree_type       0.000000
Pace              0.309266
Duration          0.400120
Language          0.048135
Mode              0.066185
Description       0.000000
Link              0.007220
Country           0.015644
City              0.009025
Continent         0.018652
Duration_years    0.008424
InEnglish         0.000000
Lang_primary      0.048135
dtype: float64

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1662 entries, 0 to 1661
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Location        1647 non-null   object
 1   School          1662 non-null   object
 2   Course          1662 non-null   object
 3   Degree_type     1662 non-null   object
 4   Pace            1148 non-null   object
 5   Duration        997 non-null    object
 6   Language        1582 non-null   object
 7   Mode            1552 non-null   object
 8   Description     1662 non-null   object
 9   Link            1650 non-null   object
 10  Country         1636 non-null   object
 11  City            1647 non-null   object
 12  Continent       1631 non-null   object
 13  Duration_years  1648 non-null   float64
 14  InEnglish       1662 non-null   bool
 15  Lang_primary    1582 non-null   object
dtypes: bool(1), float64(1), object(14)
memory usage: 289.4+ KB

In [48]:
df['Duration_years'] = df['Duration_years'].astype(float)

In [49]:
df['Duration_years'] = df['Duration_years'].fillna(df.groupby('Country')['Duration_years'].transform('mean'))

In [50]:
df['Duration_years'] = df['Duration_years'].fillna(df.groupby('Continent')['Duration_years'].transform('mean'))

In [53]:
df['Pace'].replace(np.nan, 'Unknown', inplace=True)
df['Mode'].replace(np.nan, 'Unknown', inplace=True)

In [54]:
df.dropna(subset=["Country"], axis=0, inplace=True)
df.dropna(subset=["Continent"], axis=0, inplace=True)
df.dropna(subset=["Lang_primary"], axis=0, inplace=True)

In [55]:
df.isna().sum()

Location            0
School              0
Course              0
Degree_type         0
Pace                0
Duration          606
Language            0
Mode                0
Description         0
Link               12
Country             0
City                0
Continent           0
Duration_years      0
InEnglish           0
Lang_primary        0
dtype: int64

In [56]:
df['Continent'].value_counts()

EU    552
NA    526
AS    375
OC     46
AF     31
SA     30
Name: Continent, dtype: int64

In [57]:
cmap = {'EU':'Europe','NA':'North America','AS':'Asia','OC':'Oceania','AF':'Africa','SA':'South America'}
df['Continent'] = df['Continent'].map(cmap)

In [58]:
df['Continent'].value_counts()

Europe           552
North America    526
Asia             375
Oceania           46
Africa            31
South America     30
Name: Continent, dtype: int64

In [59]:
df.to_csv('unis-tech-cleaned.csv')

In [62]:
df1 = df[['Continent','Country','City', 'School', 'Course', 'Degree_type', 'Pace', 'Duration_years','Mode', 'InEnglish', 'Lang_primary']]

In [63]:
df1.head(3)

,Continent,Country,City,School,Course,Degree_type,Pace,Duration_years,Mode,InEnglish,Lang_primary
0,Europe,Spain,Barcelona,Harbour.Space University,Bachelor of Computer Science,Bachelor,Full-time,3.0,Campus,True,English
1,Europe,Spain,Marbella,Schellhammer Business School,Bachelor in IT and Computing (Online),Bachelor,Full-time,3.0,Online,True,English
2,Europe,Germany,Berlin,IU International University of Applied Science...,B.Sc. Software Development,BSc,Full-time,3.0,Online,True,English